Revit 2024 API
BuiltInFailures.RebarSystemFailures.BarsTooSparseSpacing Property
 Bar spacing is greater than the size of the reinforced region. Decrease the Maximum Spacing parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BarsTooSparseSpacing { get; }
Visual Basic
Public Shared ReadOnly Property BarsTooSparseSpacing As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BarsTooSparseSpacing {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace